<div class="alert alert-block alert-info" style="margin-top: 20px">
    <a href="https://cocl.us/PY0101EN_edx_add_top">
         <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Ad/TopAd.png" width="750" align="center">
    </a>
</div>

<a href="https://cognitiveclass.ai/">
    <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Ad/CCLog.png" width="200" align="center">
</a>

<h1>Introduction to Pandas Python</h1>

<p><strong>Welcome!</strong> This notebook will teach you about using <code>Pandas</code> in the Python Programming Language. By the end of this lab, you'll know how to use <code>Pandas</code> package to view and access data.</p>

<h2>Table of Contents</h2>
<div class="alert alert-block alert-info" style="margin-top: 20px">
    <ul>
        <li><a href="dataset">About the Dataset</a></li>
        <li><a href="pandas">Introduction of <code>Pandas</code></a></li>
        <li><a href="data">Viewing Data and Accessing Data</a></li>
        <li><a href="quiz">Quiz on DataFrame</a></li>
    </ul>
    <p>
        Estimated time needed: <strong>15 min</strong>
    </p>
</div>

<hr>

<h2 id="dataset">About the Dataset</h2>

The table has one row for each album and several columns

<ul>
    <li><b>artist</b>: Name of the artist</li>
    <li><b>album</b>: Name of the album</li>
    <li><b>released_year</b>: Year the album was released</li>
    <li><b>length_min_sec</b>: Length of the album (hours,minutes,seconds)</li>
    <li><b>genre</b>: Genre of the album</li>
    <li><b>music_recording_sales_millions</b>: Music recording sales (millions in USD) on <a href="http://www.song-database.com/">[SONG://DATABASE]</a></li>
    <li><b>claimed_sales_millions</b>: Album's claimed sales (millions in USD) on <a href="http://www.song-database.com/">[SONG://DATABASE]</a></li>
    <li><b>date_released</b>: Date on which the album was released</li>
    <li><b>soundtrack</b>: Indicates if the album is the movie soundtrack (Y) or (N)</li>
    <li><b>rating_of_friends</b>: Indicates the rating from your friends from 1 to 10</li>
</ul>

You can see the dataset here:

<font size="1">
<table font-size:xx-small style="width:25%">
  <tr>
    <th>Artist</th>
    <th>Album</th> 
    <th>Released</th>
    <th>Length</th>
    <th>Genre</th> 
    <th>Music recording sales (millions)</th>
    <th>Claimed sales (millions)</th>
    <th>Released</th>
    <th>Soundtrack</th>
    <th>Rating (friends)</th>
  </tr>
  <tr>
    <td>Michael Jackson</td>
    <td>Thriller</td> 
    <td>1982</td>
    <td>00:42:19</td>
    <td>Pop, rock, R&B</td>
    <td>46</td>
    <td>65</td>
    <td>30-Nov-82</td>
    <td></td>
    <td>10.0</td>
  </tr>
  <tr>
    <td>AC/DC</td>
    <td>Back in Black</td> 
    <td>1980</td>
    <td>00:42:11</td>
    <td>Hard rock</td>
    <td>26.1</td>
    <td>50</td>
    <td>25-Jul-80</td>
    <td></td>
    <td>8.5</td>
  </tr>
    <tr>
    <td>Pink Floyd</td>
    <td>The Dark Side of the Moon</td> 
    <td>1973</td>
    <td>00:42:49</td>
    <td>Progressive rock</td>
    <td>24.2</td>
    <td>45</td>
    <td>01-Mar-73</td>
    <td></td>
    <td>9.5</td>
  </tr>
    <tr>
    <td>Whitney Houston</td>
    <td>The Bodyguard</td> 
    <td>1992</td>
    <td>00:57:44</td>
    <td>Soundtrack/R&B, soul, pop</td>
    <td>26.1</td>
    <td>50</td>
    <td>25-Jul-80</td>
    <td>Y</td>
    <td>7.0</td>
  </tr>
    <tr>
    <td>Meat Loaf</td>
    <td>Bat Out of Hell</td> 
    <td>1977</td>
    <td>00:46:33</td>
    <td>Hard rock, progressive rock</td>
    <td>20.6</td>
    <td>43</td>
    <td>21-Oct-77</td>
    <td></td>
    <td>7.0</td>
  </tr>
    <tr>
    <td>Eagles</td>
    <td>Their Greatest Hits (1971-1975)</td> 
    <td>1976</td>
    <td>00:43:08</td>
    <td>Rock, soft rock, folk rock</td>
    <td>32.2</td>
    <td>42</td>
    <td>17-Feb-76</td>
    <td></td>
    <td>9.5</td>
  </tr>
    <tr>
    <td>Bee Gees</td>
    <td>Saturday Night Fever</td> 
    <td>1977</td>
    <td>1:15:54</td>
    <td>Disco</td>
    <td>20.6</td>
    <td>40</td>
    <td>15-Nov-77</td>
    <td>Y</td>
    <td>9.0</td>
  </tr>
    <tr>
    <td>Fleetwood Mac</td>
    <td>Rumours</td> 
    <td>1977</td>
    <td>00:40:01</td>
    <td>Soft rock</td>
    <td>27.9</td>
    <td>40</td>
    <td>04-Feb-77</td>
    <td></td>
    <td>9.5</td>
  </tr>
</table></font>

<hr>

<h2 id="pandas">Introduction of <code>Pandas</code></h2>

In [1]:
# Dependency needed to install file 

!pip install xlrd

Requirement already satisfied: xlrd in g:\users\saad\anaconda3\lib\site-packages (1.2.0)

In [96]:
# Import required library

import pandas as pd
import numpy as np

After the import command, we now have access to a large number of pre-built classes and functions. This assumes the library is installed; in our lab environment all the necessary libraries are installed. One way pandas allows you to work with data is a dataframe. Let's go through the process to go from a comma separated values (<b>.csv</b>) file to a dataframe. This variable <code>csv_path</code> stores the path of the <b>.csv</b>, that is  used as an argument to the <code>read_csv</code> function. The result is stored in the object <code>df</code>, this is a common short form used for a variable referring to a Pandas dataframe.

In [5]:
# Read data from CSV file

csv_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

We can use the method <code>head()</code> to examine the first five rows of a dataframe:

In [6]:
# Print first five rows of the dataframe

df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

In [10]:
srted=sorted(df.Released)
srted
max(df.Released),min(df.Released),srted

(1992, 1973, [1973, 1976, 1977, 1977, 1977, 1980, 1982, 1992])

 We use the path of the excel file and the function <code>read_excel</code>. The result is a data frame as before:

In [11]:
# Read data from Excel File and print the first five rows

xlsx_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.xlsx'

df = pd.read_excel(xlsx_path)
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,00:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0

We can access the column <b>Length</b> and assign it a new dataframe <b>x</b>:

In [45]:
# Access to the column Length

x = df[['Length','Album']]#access the column by double [[]]
x

     Length                            Album
0  00:42:19                         Thriller
1  00:42:11                    Back in Black
2  00:42:49        The Dark Side of the Moon
3  00:57:44                    The Bodyguard
4  00:46:33                  Bat Out of Hell
5  00:43:08  Their Greatest Hits (1971-1975)
6  01:15:54             Saturday Night Fever
7  00:40:01                          Rumours

 The process is shown in the figure:

<img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Images/DataEgOne.png" width="750" />

<hr>

<h2 id="data">Viewing Data and Accessing Data</h2>

You can also get a column as a series. You can think of a Pandas series as a 1-D dataframe. Just use one bracket:

In [27]:
# Get the column as a series

x = df['Length']
x

0    00:42:19
1    00:42:11
2    00:42:49
3    00:57:44
4    00:46:33
5    00:43:08
6    01:15:54
7    00:40:01
Name: Length, dtype: object

You can also get a column as a dataframe. For example, we can assign the column <b>Artist</b>:

In [28]:
# Get the column as a dataframe

x = type(df[['Artist']])
x

pandas.core.frame.DataFrame

You can do the same thing for multiple columns; we just put the dataframe name, in this case, <code>df</code>, and the name of the multiple column headers enclosed in double brackets. The result is a new dataframe comprised of the specified columns:

In [54]:
# Access to multiple columns

y = df[['Artist','Length','Genre','Album']]
y.head()

,Artist,Length,Genre,Album
0,Michael Jackson,00:42:19,"pop, rock, R&B",Thriller
1,AC/DC,00:42:11,hard rock,Back in Black
2,Pink Floyd,00:42:49,progressive rock,The Dark Side of the Moon
3,Whitney Houston,00:57:44,"R&B, soul, pop",The Bodyguard
4,Meat Loaf,00:46:33,"hard rock, progressive rock",Bat Out of Hell

#### working woth iloc and loc

In [40]:
#get the first artist name using iloc
y.iloc[0,0]

'Michael Jackson'

In [65]:
#access date time value
y.loc[0,'Length'],y.loc[0,'Length'].hour,y.loc[0,'Length'].minute,y.loc[0,'Length'].second

(datetime.time(0, 42, 19), 0, 42, 19)

In [84]:
#use loc to slice y
z=y.loc[:,'Artist':'Length']
z

            Artist    Length
0  Michael Jackson  00:42:19
1            AC/DC  00:42:11
2       Pink Floyd  00:42:49
3  Whitney Houston  00:57:44
4        Meat Loaf  00:46:33
5           Eagles  00:43:08
6         Bee Gees  01:15:54
7    Fleetwood Mac  00:40:01

The process is shown in the figure:

<img src = "https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Images/DataEgTwo.png" width="1100" />

One way to access unique elements is the <code>iloc</code> method, where you can access the 1st row and the 1st column as follows:

In [66]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Michael Jackson'

You can access the 2nd row and the 1st column as follows:

In [67]:
# Access the value on the second row and the first column

df.iloc[1,0]

'AC/DC'

You can access the 1st row and the 3rd column as follows:

In [68]:
# Access the value on the first row and the third column

df.iloc[0,2]

1982

You can access the column using the name as well, the following are the same as above:

In [108]:
# Access the column using the name

df.loc[0, 'Artist']
#or you can use 
df.at[0, 'Artist']

'Michael Jackson'

In [70]:
# Access the column using the name

df.loc[1, 'Artist']

'AC/DC'

In [113]:
# Access the column using the name

df.loc[0, 'Released']
#or you can use iat to get scaler
df.iat[0, 2]

1982

In [72]:
# Access the column using the name

df.loc[1, 'Released']

1980

You can perform slicing using both the index and the name of the column:

In [110]:
# Slicing the dataframe

df.iloc[0:2, 0:3]

            Artist          Album  Released
0  Michael Jackson       Thriller      1982
1            AC/DC  Back in Black      1980

In [74]:
# Slicing the dataframe using name

df.loc[0:2, 'Artist':'Released']

            Artist                      Album  Released
0  Michael Jackson                   Thriller      1982
1            AC/DC              Back in Black      1980
2       Pink Floyd  The Dark Side of the Moon      1973

<hr>

<h2 id="quiz">Quiz on DataFrame</h2>

Use a variable <code>q</code> to store the column <b>Rating</b> as a dataframe

In [91]:
# Write your code below and press Shift+Enter to execute
q=df[['Rating']]
q
#or you can use
q=df.loc[:,['Rating']]
q

   Rating
0    10.0
1     9.5
2     9.0
3     8.5
4     8.0
5     7.5
6     7.0
7     6.5

Double-click __here__ for the solution.

<!-- Your answer is below:
q = df[['Rating']]
q
-->

Assign the variable <code>q</code> to the dataframe that is made up of the column <b>Released</b> and <b>Artist</b>:

In [92]:
# Write your code below and press Shift+Enter to execute
q=df.loc[:,['Released','Artist']]
q

   Released           Artist
0      1982  Michael Jackson
1      1980            AC/DC
2      1973       Pink Floyd
3      1992  Whitney Houston
4      1977        Meat Loaf
5      1976           Eagles
6      1977         Bee Gees
7      1977    Fleetwood Mac

Double-click __here__ for the solution.

<!-- Your answer is below:
q = df[['Released', 'Artist']]
q
-->

Access the 2nd row and the 3rd column of <code>df</code>:

In [94]:
# Write your code below and press Shift+Enter to execute
df.iloc[1,2]

1980

Double-click __here__ for the solution.

<!-- Your answer is below:
df.iloc[1, 2]
-->

# Additional faetures

In [169]:
#create dataframe by passing a dict of objects that can be converted to series-like
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                      'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                  'F': 'foo'})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [102]:
#get datatype for each column
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [103]:
#get the index of dataframe
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [104]:
#describe() shows a quick statistic summary of your data:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [105]:
#sort by index
df2.sort_index(axis=1, ascending=False)# sort columns desc

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [107]:
df2.sort_index(axis=0, ascending=False)#sort rows desc

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
0  1.0 2013-01-02  1.0  3   test  foo

In [122]:
#change specific cell in the dataframe
df2.loc[2,'F']=np.nan
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  NaN
3  1.0 2013-01-02  1.0  3  train  foo

In [126]:
#To drop any rows that have missing data.
df2=df2.dropna(how='any')
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [131]:
#reset index after delete na row
df2=df2.reindex(index=range(0,3), columns=list(df2.columns))
df2

     A          B    C    D      E    F
0  1.0 2013-01-02  1.0  3.0   test  foo
1  1.0 2013-01-02  1.0  3.0  train  foo
2  NaN        NaT  NaN  NaN    NaN  NaN

In [136]:
df2.loc[2,'D']

3

In [151]:
df2.loc[2,'D']=np.nan
df2

     A          B    C    D      E    F
0  1.0 2013-01-02  1.0  3.0   test  foo
1  1.0 2013-01-02  1.0  3.0  train  foo
2  1.0 2013-01-02  1.0  NaN   test  foo
3  1.0 2013-01-02  1.0  3.0  train  foo

In [146]:
#fill nan cell with mean of the column
df2['D']=df2['D'].fillna(df2['D'].mean())
df2

     A          B    C    D      E    F
0  1.0 2013-01-02  1.0  3.0   test  foo
1  1.0 2013-01-02  1.0  3.0  train  foo
2  1.0 2013-01-02  1.0  3.0   test  foo
3  1.0 2013-01-02  1.0  3.0  train  foo

In [158]:
#get columns with null values
df2.isna().sum()

A    0
B    0
C    0
D    1
E    0
F    0
dtype: int64

In [170]:
def mul(x):
    print('before: ',x)
    return x*3

In [171]:
#apply function on the data 
df2['D']=df2['D'].apply(lambda x: mul(x))
df2

before:  3
before:  3
before:  3
before:  3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  9   test  foo
1  1.0 2013-01-02  1.0  9  train  foo
2  1.0 2013-01-02  1.0  9   test  foo
3  1.0 2013-01-02  1.0  9  train  foo

In [180]:
#concatinate 
df3=df2.iloc[:,:]
frames=[df2,df3]
pd.concat(frames)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  9   test  foo
1  1.0 2013-01-02  1.0  9  train  foo
2  1.0 2013-01-02  1.0  9   test  foo
3  1.0 2013-01-02  1.0  9  train  foo
0  1.0 2013-01-02  1.0  9   test  foo
1  1.0 2013-01-02  1.0  9  train  foo
2  1.0 2013-01-02  1.0  9   test  foo
3  1.0 2013-01-02  1.0  9  train  foo

In [188]:
#join
left = pd.DataFrame({'key': ['key1', 'key2','key4'], 'lval': [1, 2,3]})

right = pd.DataFrame({'key': ['key3', 'key1','key4'], 'rval': [4, 5,4]})
pd.merge(right,left,on='key')#get on the related (inner join)

    key  rval  lval
0  key1     5     1
1  key4     4     3

In [201]:
#reshaping the dataframe and convert it to series type
stacked=df2.stack()
stacked

0  A                      1
   B    2013-01-02 00:00:00
   C                      1
   D                      9
   E                   test
   F                    foo
1  A                      1
   B    2013-01-02 00:00:00
   C                      1
   D                      9
   E                  train
   F                    foo
2  A                      1
   B    2013-01-02 00:00:00
   C                      1
   D                      9
   E                   test
   F                    foo
3  A                      1
   B    2013-01-02 00:00:00
   C                      1
   D                      9
   E                  train
   F                    foo
dtype: object

In [204]:
#reversing the stack method
stacked.unstack()

   A          B  C  D      E    F
0  1 2013-01-02  1  9   test  foo
1  1 2013-01-02  1  9  train  foo
2  1 2013-01-02  1  9   test  foo
3  1 2013-01-02  1  9  train  foo

In [206]:
# create pivot table
pd.pivot_table(df2, values='D', index=['A', 'B'], columns=['C'])

C               1.0
A   B
1.0 2013-01-02    9

In [215]:
#categorical data 
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                    "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [216]:
df["grade"].cat.categories

Index(['a', 'b', 'e'], dtype='object')

In [217]:
#change the categories names
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [219]:
#adding new categories
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium",
                                      "good", "very good"])
df["grade"].cat.categories

Index(['very bad', 'bad', 'medium', 'good', 'very good'], dtype='object')

In [220]:
# sort by categorical column(Sorting is per order in the categories, not lexical order.)
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [221]:
#get the size for each category
df.groupby('grade').size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

# Plotting

In [236]:
ts = pd.Series(np.random.randn(1000),
                 index=pd.date_range('1/1/2000', periods=1000))
ts
#ts.plot()

2000-01-01    2.475840
2000-01-02    0.086707
2000-01-03   -0.218966
2000-01-04    0.742875
2000-01-05    1.374447
                ...
2002-09-22    0.571744
2002-09-23   -0.171114
2002-09-24    1.832069
2002-09-25    0.705923
2002-09-26    1.852301
Freq: D, Length: 1000, dtype: float64

In [237]:
#commulative sum(sum each cell with the previous one)
ts = ts.cumsum()
ts

2000-01-01     2.475840
2000-01-02     2.562547
2000-01-03     2.343581
2000-01-04     3.086456
2000-01-05     4.460903
                ...
2002-09-22     6.530962
2002-09-23     6.359849
2002-09-24     8.191918
2002-09-25     8.897840
2002-09-26    10.750142
Freq: D, Length: 1000, dtype: float64

<hr>
<h2>The last exercise!</h2>
<p>Congratulations, you have completed your first lesson and hands-on lab in Python. However, there is one more thing you need to do. The Data Science community encourages sharing work. The best way to share and showcase your work is to share it on GitHub. By sharing your notebook on GitHub you are not only building your reputation with fellow data scientists, but you can also show it off when applying for a job. Even though this was your first piece of work, it is never too early to start building good habits. So, please read and follow <a href="https://cognitiveclass.ai/blog/data-scientists-stand-out-by-sharing-your-notebooks/" target="_blank">this article</a> to learn how to share your work.
<hr>

<div class="alert alert-block alert-info" style="margin-top: 20px">
<h2>Get IBM Watson Studio free of charge!</h2>
    <p><a href="https://cocl.us/PY0101EN_edx_add_bbottom"><img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Ad/BottomAd.png" width="750" align="center"></a></p>
</div>

<h3>About the Authors:</h3>  
<p><a href="https://www.linkedin.com/in/joseph-s-50398b136/" target="_blank">Joseph Santarcangelo</a> is a Data Scientist at IBM, and holds a PhD in Electrical Engineering. His research focused on using Machine Learning, Signal Processing, and Computer Vision to determine how videos impact human cognition. Joseph has been working for IBM since he completed his PhD.</p>

Other contributors: <a href="www.linkedin.com/in/jiahui-mavis-zhou-a4537814a">Mavis Zhou</a>

<hr>

<p>Copyright &copy; 2018 IBM Developer Skills Network. This notebook and its source code are released under the terms of the <a href="https://cognitiveclass.ai/mit-license/">MIT License</a>.</p>